src/test/resources/wire-tests/CardPaymentsPaymentsWireTest_testCreate_request.json

{
  "channel": "web",
  "processingTerminalId": "1234001",
  "operator": "Jane",
  "order": {
    "orderId": "OrderRef6543",
    "description": "Large Pepperoni Pizza",
    "amount": 4999,
    "currency": "USD"
  },
  "customer": {
    "firstName": "Sarah",
    "lastName": "Hopper",
    "billingAddress": {
      "address1": "1 Example Ave.",
      "address2": "Example Address Line 2",
      "address3": "Example Address Line 3",
      "city": "Chicago",
      "state": "Illinois",
      "country": "US",
      "postalCode": "60056"
    },
    "shippingAddress": {
      "recipientName": "Sarah Hopper",
      "address": {
        "address1": "1 Example Ave.",
        "address2": "Example Address Line 2",
        "address3": "Example Address Line 3",
        "city": "Chicago",
        "state": "Illinois",
        "country": "US",
        "postalCode": "60056"
      }
    }
  },
  "paymentMethod": {
    "cardDetails": {
      "device": {
        "model": "bbposChp",
        "serialNumber": "1850010868"
      },
      "rawData": "A1B2C3D4E5F67890ABCD1234567890ABCDEF1234567890ABCDEF1234567890ABCDEF",
      "entryMethod": "raw"
    },
    "type": "card"
  },
  "customFields": [
    {
      "name": "yourCustomField",
      "value": "abc123"
    }
  ]
}